// Задача 45: Напишите программу, которая будет создавать
// копию заданного массива с помощью поэлементного
// копирования.

// int[] ReturnArray(int[] array)
// {
//     int[] arr = new int[array.Length];
//     for (int i = 0; i < arr.Length; i++)
//     {
//         arr[i] = array[i];
//     }
//     return arr;
// }

// int[] arr1 = CreateArray(10, 1, 20);

// PrintArray(arr1);
// int[] arr2 = ReturnArray(arr1);
// PrintArray(arr2);

// Console.WriteLine("Изменим втрое значение в массиве, чтобы определить скопированный массив");

// arr1[1] = 30;
// PrintArray(arr1);
// PrintArray(arr2);